Repository: fauzan-january/clipboard-content-editor
Catalog: addon/locale/*/LC_MESSAGES/nvda.po
Languages: id, uk

source: What's new information is unavailable.
uk: Що нового інформація недоступна.

source: Clipboard Content Editor - What's New
uk: Редактор вмісту буфера обміну - Що нового

source: Clipboard Content Editor - Installation
uk: Редактор вмісту буфера обміну - встановлення

source: Do you want to continue installation or see what's new first?
uk: Бажаєте продовжити встановлення чи спочатку подивитися, що нового?

source: &See what's new
uk: &Дізнатись, що нового

source: &Continue Installation
id: &Lanjutkan instalasi
uk: &Продовжити встановлення

source: Clipboard information: {chars} characters, {words} words, {lines} lines
uk: Інформація з буфера обміну: {chars} символів, {words} слів, {lines} рядків

source: Clipboard is empty
id: Clipboard kosong
uk: Буфер обміну порожній

source: Clipboard Content Editor
uk: Редактор вмісту буфера обміну

source: Clipboard content:
id: Isi clipboard:
uk: Вміст буфера обміну:

source: &Information
id: &Informasi
uk: &Інформація

source: &Find
uk: &Знайти

source: &Replace
uk: &Замінити

source: Save (Ctrl+S)
uk: Зберегти (Ctrl+S)

source: Save As... (Ctrl+Shift+S)
uk: Зберегти як... (Ctrl+Shift+S)

source: Cancel (Esc)
uk: Скасувати (Esc)

source: Clipboard updated
id: Clipboard diperbarui
uk: Буфер обміну оновлено

source: Failed to update clipboard
id: Gagal memperbarui clipboard
uk: Не вдалося оновити буфер обміну

source: Save as
uk: Зберегти як

source: Text files (*.txt)|*.txt|All files (*.*)|*.*
uk: Текстові файли (*.txt)|*.txt|Всі файли (*.*)|*.*

source: File saved
uk: Файл збережено

source: Error saving file: {error}
uk: Помилка збереження файлу: {error}

source: Changes canceled
id: Perubahan dibatalkan
uk: Зміни скасовано

source: You have unsaved changes. Discard them?
id: Anda memiliki perubahan yang belum disimpan. Buang perubahan ini?
uk: У вас є незбережені зміни. Відхилити їх?

source: Opens a clipboard editor to modify the current clipboard text.
id: Membuka editor clipboard untuk mengubah teks clipboard saat ini.
uk: Відкриває редактор буфера обміну для зміни поточного тексту буфера обміну.

source: Shows information about the current clipboard text.
id: Menampilkan informasi tentang teks clipboard saat ini.
uk: Показує інформацію про поточний текст буфера обміну.

source: Restores the previous clipboard content from backup.
id: Memulihkan isi clipboard sebelumnya dari cadangan.
uk: Відновлює попередній вміст буфера обміну з резервної копії.

source: Protect mode is disabled
id: Mode proteksi dinonaktifkan
uk: Режим захисту вимкнено

source: No backup available
id: Tidak ada cadangan
uk: Немає резервної копії

source: Previous clipboard restored
id: Clipboard sebelumnya dipulihkan
uk: Попередній буфер обміну відновлено

source: Failed to restore clipboard
id: Gagal memulihkan clipboard
uk: Не вдалося відновити буфер обміну

source: Replace
id: Ganti
uk: Замінити

source: Source text
uk: Вихідний текст

source: Replacement text
uk: Текст для заміни

source: Case sensitive
uk: З урахуванням регістру

source: Replace whole words only, not part of other words
uk: Замінювати лише цілі слова, а не частину інших слів

source: Find next
id: Cari berikutnya
uk: Знайти далі

source: Replace all
id: Ganti semua
uk: Замінити все

source: Find text is empty
id: Teks pencarian kosong
uk: Текст для пошуку порожній

source: Text not found
id: Teks tidak ditemukan
uk: Текст не знайдено

source: {count} replacements
id: {count} penggantian
uk: {count} замін

source: Find
id: Cari
uk: Знайти

source: Find what
uk: Що шукаємо

source: Find whole words only, not part of other words
uk: Знайти тільки цілі слова, а не частини інших слів

source: Enable &sound
uk: Увімкнути &звук

source: Keep shortcuts active when buttons are hidden in editor
id: Tetap aktifkan shortcut saat tombol disembunyikan di editor
uk: Зберігати активність гарячих клавіш, коли кнопки приховані в редакторі

source: Enable &information button in editor
id: Aktifkan tombol &informasi di editor
uk: Увімкнути &інформаційну кнопку в редакторі

source: Enable &find button in editor
uk: Увімкнути кнопку &знайти в редакторі

source: Enable &replace button in editor
uk: Увімкнути кнопку &замінити в редакторі

source: Enable &protect mode (clipboard backup)
id: Aktifkan mode &proteksi (cadangan clipboard)
uk: Увімкнути &режим захисту (резервне копіювання буфера обміну)

source: Number of backup &levels
id: Jumlah &level cadangan
uk: Кількість &рівнів резервного копіювання

source: Edits the current clipboard text in a simple editor so pasted content reflects the changes. Shortcuts: NVDA+E opens the editor, NVDA+Z restores the previous clipboard, and NVDA+I shows clipboard info.
uk: Редагує поточний текст у буфері обміну в простому редакторі, щоб вставлений вміст відображав зміни. Гарячі клавіші: NVDA+E відкриває редактор, NVDA+Z відновлює попередній буфер обміну, NVDA+I показує інформацію про буфер обміну.

source: - Added **Save As** feature (Ctrl+Shift+S) to the editor, allowing content to be saved as .txt or other file types. - Added a setting to enable or disable addon sounds. - Added comprehensive sound feedback to Information, Restore Backup, and Replace All features for consistent audio cues. - Fixed the "Read in [Language]" links in the documentation to correctly open the HTML files instead of showing file not found errors or opening raw source files. - The editor buttons are now strictly ordered for better navigation: Information -> Find -> Replace -> Save -> Save As -> Cancel.
uk: - Додано функцію **Зберегти як** (Ctrl+Shift+S) до редактора, що дозволяє зберігати вміст у форматі .txt або інших типах файлів. - Додано налаштування для ввімкнення або вимкнення звуків додатка. - Додано комплексний звуковий супровід до функцій «Інформація», «Відновити резервну копію» та «Замінити все» для забезпечення послідовних звукових сигналів. - Виправлено посилання «Читати [Мову]» в документації, щоб правильно відкривати HTML-файли замість відображення помилок про відсутність файлу або відкриття необроблених вихідних файлів. - Кнопки редактора тепер розташовані в строгому порядку для кращої навігації: Інформація -> Знайти -> Замінити -> Зберегти -> Зберегти як -> Скасувати.

source: Clipboard Content Editor - Donation
id: Clipboard Content Editor - Donasi

source: Thank you for using Clipboard Content Editor.
id: Terima kasih telah menggunakan Clipboard Content Editor.

source: If you would like to support development, you can donate using:
id: Jika Anda ingin mendukung pengembangan, Anda bisa berdonasi melalui:

source: Credit card: {number}
id: Kartu kredit: {number}

source: Name: {name}
id: Atas nama: {name}

source: Other methods (Indonesia):
id: Metode lain (Indonesia):

source: Open donation &page
id: Buka halaman &donasi

source: &Copy card number
id: &Salin nomor kartu

source: Unable to open the donation page right now.
id: Tidak dapat membuka halaman donasi saat ini.

source: Donation
id: Donasi

source: Card number copied to clipboard.
id: Nomor kartu disalin ke clipboard.

source: Unable to copy the card number right now.
id: Tidak dapat menyalin nomor kartu saat ini.

source: Information: {chars} characters, {words} words, {lines} lines
id: Informasi: {chars} karakter, {words} kata, {lines} baris

source: &Clear
id: &Bersihkan

source: &Read
id: &Baca

source: &Find/Replace
id: &Cari/Ganti

source: &Save
id: &Simpan

source: Cancel
id: Batal

source: Failed to clear clipboard
id: Gagal mengosongkan clipboard

source: Clipboard cleared
id: Clipboard dikosongkan

source: Reads the current clipboard text.
id: Membaca teks clipboard saat ini.

source: Find/Replace
id: Cari/Ganti

source: Match case
id: Cocokkan huruf besar/kecil

source: Enable &clear button in editor
id: Aktifkan tombol &bersihkan di editor

source: Enable &read button in editor
id: Aktifkan tombol &baca di editor

source: Enable &find/replace button in editor
id: Aktifkan tombol &cari/ganti di editor
